In [1]:
import pandas as pds
dataw = {'Name':['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'], 
        'Age':[22, 32, 12, 52], 
        'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons'],
        'Salary':[1000, 2000, 3000, 4000]}

In [2]:
dataq = pds.DataFrame(dataw,index=['a','b','c','d'])

In [3]:
for i in dataq.iterrows():
    print(i)

('a', Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Salary                1000
Name: a, dtype: object)
('b', Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Salary              2000
Name: b, dtype: object)
('c', Name                Dhiraj
Age                     12
Address          Allahabad
Qualification         Bcom
Salary                3000
Name: c, dtype: object)
('d', Name              Hitesh
Age                   52
Address          Kannuaj
Qualification     B.hons
Salary              4000
Name: d, dtype: object)

In [4]:
for i,j in dataq.iterrows():
    print(i,j)

a Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Salary                1000
Name: a, dtype: object
b Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Salary              2000
Name: b, dtype: object
c Name                Dhiraj
Age                     12
Address          Allahabad
Qualification         Bcom
Salary                3000
Name: c, dtype: object
d Name              Hitesh
Age                   52
Address          Kannuaj
Qualification     B.hons
Salary              4000
Name: d, dtype: object

In [5]:
for i,j in dataq.iterrows():
    print(i,j[0])

a Gaurav
b Anuj
c Dhiraj
d Hitesh

In [6]:
for i,j in dataq.items():
    print(i,j)

Name a    Gaurav
b      Anuj
c    Dhiraj
d    Hitesh
Name: Name, dtype: object
Age a    22
b    32
c    12
d    52
Name: Age, dtype: int64
Address a    Allahabad
b      Kannuaj
c    Allahabad
d      Kannuaj
Name: Address, dtype: object
Qualification a       MCA
b       Phd
c      Bcom
d    B.hons
Name: Qualification, dtype: object
Salary a    1000
b    2000
c    3000
d    4000
Name: Salary, dtype: int64

In [7]:
list(dataq['Name'])

['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh']

In [8]:
data = dataq['Age'].sum()
data

118

In [9]:
dataq.apply(lambda x: x.sum())

Name                       GauravAnujDhirajHitesh
Age                                           118
Address          AllahabadKannuajAllahabadKannuaj
Qualification                    MCAPhdBcomB.hons
Salary                                      10000
dtype: object

In [10]:
dataq.apply(lambda x: x.sum())

Name                       GauravAnujDhirajHitesh
Age                                           118
Address          AllahabadKannuajAllahabadKannuaj
Qualification                    MCAPhdBcomB.hons
Salary                                      10000
dtype: object

In [11]:
dataq.columns

Index(['Name', 'Age', 'Address', 'Qualification', 'Salary'], dtype='object')

In [12]:
dataq[['Age','Salary']]

   Age  Salary
a   22    1000
b   32    2000
c   12    3000
d   52    4000

In [13]:
#dataq.applymap(lambda x : x**2)

In [14]:
dataq.sort_values('Name')

     Name  Age    Address Qualification  Salary
b    Anuj   32    Kannuaj           Phd    2000
c  Dhiraj   12  Allahabad          Bcom    3000
a  Gaurav   22  Allahabad           MCA    1000
d  Hitesh   52    Kannuaj        B.hons    4000

In [15]:
dataq.sort_index()

     Name  Age    Address Qualification  Salary
a  Gaurav   22  Allahabad           MCA    1000
b    Anuj   32    Kannuaj           Phd    2000
c  Dhiraj   12  Allahabad          Bcom    3000
d  Hitesh   52    Kannuaj        B.hons    4000

In [16]:
dataq.sort_index(ascending=False)

     Name  Age    Address Qualification  Salary
d  Hitesh   52    Kannuaj        B.hons    4000
c  Dhiraj   12  Allahabad          Bcom    3000
b    Anuj   32    Kannuaj           Phd    2000
a  Gaurav   22  Allahabad           MCA    1000

In [17]:
pds.set_option("display.max_colwidth",1000)
dataf = pds.DataFrame({"data":["Cutting-edge technologies like Data Science, Data Analytics, Artificial Intelligence (AI) and Machine Learning (ML) are exceedingly pushing the boundaries of what we considered realistically possible. Don’t be surprised if hiring Data Scientists, Data Analysts, AI Specialists and Machine Learning Engineers rank high on the list of business priorities in 2021. Companies will need these professionals to make sense of the vast amounts of data gathered on a daily basis, providing Decision Makers with immensely valuable and accurate data-driven market insights and information before any business strategy is executed.","i ready to start my carreer"," hii"]})

In [18]:
dataf

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          data
0  Cutting-edge technologies like Data Science, Data Analytics, Artificial Intelligence (AI) and Machine Learning (ML) are exceedingly pushing the boundaries of what we considered realistically possible. Don’t be surprised if hiring Data Scientists, Data Analysts, AI Specialists and Machine Learning Engineers rank high on the list of business priorities in 2021. Companies will need these professionals to make sense of the vast amounts of data gathered on a daily basis, providing Decision Makers with immensely valuable and accurate data-driven market insights and information before any business strategy is executed.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  i ready to start my carreer
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          hii

In [19]:
dataf['word_count'] = dataf['data'].apply(lambda x: len(x.split()))

In [20]:
dataf

,data,word_count
0,"Cutting-edge technologies like Data Science, Data Analytics, Artificial Intelligence (AI) and Machine Learning (ML) are exceedingly pushing the boundaries of what we considered realistically possible. Don’t be surprised if hiring Data Scientists, Data Analysts, AI Specialists and Machine Learning Engineers rank high on the list of business priorities in 2021. Companies will need these professionals to make sense of the vast amounts of data gathered on a daily basis, providing Decision Makers with immensely valuable and accurate data-driven market insights and information before any business strategy is executed.",88
1,i ready to start my carreer,6
2,hii,1

In [23]:
df4 = pds.DataFrame({'a':[3,4,5,2,1,3,4,5,6]})
df4

   a
0  3
1  4
2  5
3  2
4  1
5  3
6  4
7  5
8  6

In [25]:
df4['a'].rolling(window=1).mean()

0    3.0
1    4.0
2    5.0
3    2.0
4    1.0
5    3.0
6    4.0
7    5.0
8    6.0
Name: a, dtype: float64

In [27]:
df4['a'].rolling(window=2).mean()

0    NaN
1    3.5
2    4.5
3    3.5
4    1.5
5    2.0
6    3.5
7    4.5
8    5.5
Name: a, dtype: float64

In [28]:
df4['a'].rolling(window=3).mean()

0         NaN
1         NaN
2    4.000000
3    3.666667
4    2.666667
5    2.000000
6    2.666667
7    4.000000
8    5.000000
Name: a, dtype: float64

In [30]:
df4['a'].rolling(window=1).sum()

0    3.0
1    4.0
2    5.0
3    2.0
4    1.0
5    3.0
6    4.0
7    5.0
8    6.0
Name: a, dtype: float64

In [31]:
df4['a'].rolling(window=2).sum()

0     NaN
1     7.0
2     9.0
3     7.0
4     3.0
5     4.0
6     7.0
7     9.0
8    11.0
Name: a, dtype: float64

In [35]:
df4['a'].cumsum()

0     3
1     7
2    12
3    14
4    15
5    18
6    22
7    27
8    33
Name: a, dtype: int64